#include "count_exchange.h"

void opening_scene()//开始界面
{
    cout<<"欢迎使用本进制转换器"<<endl;
    cout<<"本进制转换器的作用为十进制数与二、八、十六进制数间的转化"<<endl;
    cout<<"==================================================================================="<<endl;
    cout<<"输入 1 开始使用转换器，输入 2 查询相关说明，输入 0 退出此程序"<<endl;
    cout<<"注意：本转化器默认输入数据为非负整数，若输入负数，则直接在对应正数前加负号代表"<<endl;
    cout<<"-----------------------------------------------------------------------------------"<<endl;
}

void introduction()//说明
{
    cout<<"输入 1 开始使用转换器，输入 2 查询相关说明，输入 0 退出此程序"<<endl;
    cout<<"请先输入转化后进制，再输入原数据"<<endl;
    cout<<endl;
}
